package utils;

/**
 * @author Denis Danilin | denis@danilin.name
 * 16.05.2020
 * tfs ☭ sweat and blood
 */
public enum UserMode {
    Normal, // всё разрешено
    Gear, // переходы запрещены, только оффсет директории, из верхних кнопок только "сброс"
    Moving, // смотрим только директории, из верхних кнопок только "назад", "положить" и "сброс"
    Searching, // из верхних кнопок только "поиск" (заново), "gear" и "сброс", переход в дир отменяет режим
    GearSearch // работа с найденным, сброс приводит к переходу в "поиск"
}
